var $table = $('#table5_1');
$(function () {
	var data = [
		{
			"author": "張大春",
			"reference": "《大說謊家》，台北：遠流",
			"year": "1989年"
		},
		{
			"author": "張大春",
			"reference": "《沒人寫信給上校》，台北：聯合文學",
			"year": "1994年"
		},
		{
			"author": "張大春",
			"reference": "《撒謊的信徒》，台北：聯合文學",
			"year": "1996年"
		},
		{
			"author": "張大春",
			"reference": "《公寓導遊》，台北：時報文化",
			"year": "1986年"
		},
		{
			"author": "張大春",
			"reference": "〈蛤蟆王〉《公寓導遊》，台北：時報文化",
			"year": "1986年"
		},
		{
			"author": "張大春",
			"reference": "〈蛤蟆王〉，《公寓導遊》，台北：時報文化",
			"year": "1986年"
		},
		{
			"author": "張大春",
			"reference": "〈印巴茲共和國事件錄〉，《公寓導遊》，台北：時報文化",
			"year": "1986年"
		},
		{
			"author": "張大春",
			"reference": "〈天火備忘錄〉，《公寓導遊》，台北：時報文化",
			"year": "1986年"
		},
		{
			"author": "張大春",
			"reference": "《四喜憂國》，台北：遠流",
			"year": "1988年"
		},
		{
			"author": "張大春",
			"reference": "《時間軸》，台北：時報",
			"year": "1986年"
		},
		{
			"author": "張大春",
			"reference": "《小說稗類》，台北：聯合文學",
			"year": "1998年"
		},
		{
			"author": "張大春",
			"reference": "〈一切都是創作--新聞‧小說‧新聞小說〉，《中時晚報》，後收錄在《張大春的文學意見》",
			"year": "1991年4月7日"
		},
		{
			"author": "張大春",
			"reference": "〈以情節主宰一切--說說「莫言高密東北鄉」的「小說背景」〉，《文學不安--張大春的小說意見》，台北：聯合文學，139-148",
			"year": ""
		},
		{
			"author": "張大春",
			"reference": "〈這次小說真的死了嗎？〉，《遠見》，128-129頁",
			"year": "1999年2月"
		},
		{
			"author": "張大春著、高天生編",
			"reference": "《張大春集》，台北：前衛",
			"year": "1992年"
		},
		{
			"author": "張大春",
			"reference": "《張大春的文學意見》，台北：遠流",
			"year": "1992年"
		},
		{
			"author": "張大春",
			"reference": "《文學不安--張大春的小說意見》，台北：聯合文學",
			"year": "1995年"
		},
		{
			"author": "楊照",
			"reference": "〈青春的哀愁是怎麼一回事？-讀大頭春的《我妹妹》〉，《我妹妹》，台北：聯合文學，176-184頁",
			"year": "1993年"
		},
		{
			"author": "許琇禛",
			"reference": "〈「詮釋」的解構-張大春小說研究〉，《台北市立師範學院學報》，30期，253-266頁",
			"year": "1999年"
		},
		{
			"author": "陳燕珠",
			"reference": "〈論張大春「新聞小說」的書寫策略及其敘述美學〉，《台南師院學生學刊》，18 期，73-90頁",
			"year": "1997年"
		},
		{
			"author": "鄭明娳",
			"reference": "〈評析張大春「將軍碑」〉，《自由青年》，76卷5期，48-51頁",
			"year": "1986年"
		},
		{
			"author": "陳芳明",
			"reference": "〈當後殖民遇到後現代-誤讀張大春「撒謊的信徒」〉，《中外文學》，149-154頁",
			"year": "1996年"
		},
		{
			"author": "楊錦郁記錄整理",
			"reference": "〈創造新的類型，提供新的刺激-李瑞騰專訪張大春〉，《文訊》，60期，85-90頁",
			"year": "1994年"
		},
		{
			"author": "阿盛",
			"reference": "〈變與不變一大春--從《雞翎圖》到《公寓導遊》〉，《文訊》，29期",
			"year": "1987年"
		},
		{
			"author": "林燿德",
			"reference": "〈蘇非斯特的言語--從《公寓導遊》看張大春的小說策略〉，《文訊》，28期，268-273頁",
			"year": "1987年"
		},
		{
			"author": "林燿德",
			"reference": "〈「宏志憂春」以及其它--關於張大春《四喜憂國》的危言〉，《文訊》，38期，174-178頁",
			"year": "1988年"
		},
		{
			"author": "孟 悅",
			"reference": "〈評張大春《四喜憂國》〉，當代作家評論，3期",
			"year": "1989年"
		},
		{
			"author": "林燿德",
			"reference": "〈如果張大春--導讀《如果林秀雄》〉，《台北評論》",
			"year": "1990年"
		},
		{
			"author": "胡衍南",
			"reference": "〈捨棄原鄉鄉愁的兩個模式談朱天心、張大春的小說創作〉，《臺灣文學觀察雜誌》，117-135頁，7期",
			"year": ""
		},
		{
			"author": "王中興",
			"reference": "《張大春\"沒人寫信給上校\"與賈西亞‧馬奎斯\"預知死亡紀事\"主題探討與比較》，輔仁大學西班牙文研究所碩士論文",
			"year": "1998年"
		},
		{
			"author": "駱以軍",
			"reference": "〈「後」知死亡紀事〉，《中國時報》，42版",
			"year": "1983年9月22日"
		},
		{
			"author": "尼洛、齊邦媛、劉紹銘",
			"reference": "〈第九屆時報文學獎評審意見--關於張大春的〈將軍碑〉〉，中國時報",
			"year": "1986年10月3-4日"
		},
		{
			"author": "李明駿",
			"reference": "〈歷史的糾結纏繞：讀張大春的小說《時間軸》〉，《當代》，第十一期，146-150頁",
			"year": "1987年3月"
		},
		{
			"author": "蔡源煌",
			"reference": "〈張大春的天方夜譚--評〈自莽林躍出〉〉，《中國時報》，後收錄於《四喜憂國》",
			"year": "1987年5月22日"
		},
		{
			"author": "蔡詩萍",
			"reference": "〈符號的疏離人--評張大春的《四喜憂國》〉，《聯合文學》，48期，195-196頁",
			"year": "1988年10月"
		},
		{
			"author": "黃凡、廖仁義、康來新等",
			"reference": "〈他創造了怎樣的陷阱--評張大春《四喜憂國》〉，《自立晚報》",
			"year": "1988年10月30日"
		},
		{
			"author": "蔡源煌",
			"reference": "〈八０年代的寵兒--張大春〉，《自立晚報》",
			"year": "1989年10月31日"
		},
		{
			"author": "楊旻瑋記錄",
			"reference": "〈比窮比病比落難-張大春作品〈四喜憂國〉〉，《文藝月刊》，246期，21-31頁",
			"year": "1989年12月"
		},
		{
			"author": "呂興昌",
			"reference": "〈瞎掰胡扯的藝術--評張大春《大說謊家》〉，《新地文學》 一卷一期",
			"year": "1990年4月"
		},
		{
			"author": "詹愷苓",
			"reference": "〈誰在說謊？為何說謊？如何說謊？--評張大春《大說謊家》〉，《自立晚報》",
			"year": "1990年9月24-25日"
		},
		{
			"author": "梅家玲",
			"reference": "〈眾聲喧嘩中的《我妹妹》-論張大春《我妹妹》的多重解讀策略及其美學趣味〉，《聯合文學》，140-150頁",
			"year": "1995年2月"
		},
		{
			"author": "朱雙一",
			"reference": "〈語言陷阱的顛覆-張大春論〉，《聯合文學》，第十一卷八期，132-136頁",
			"year": "1995年6月"
		},
		{
			"author": "謝金蓉",
			"reference": "〈張大春向李登輝投了一顆文學炸彈〉，《新新聞週刊》，80-83頁",
			"year": "1996年3月3-9日"
		},
		{
			"author": "屈繼堯",
			"reference": "〈向撒謊的信徒射鏢--張大春的政治文學〉，《遠見》，148-151頁",
			"year": "1996年5月15日"
		},
		{
			"author": "裴元領",
			"reference": "〈撒謊之鞭：評張大春的《撒謊的信徒》〉，《聯合文學》，第十二卷八期，100-103頁",
			"year": "1996年6月"
		},
		{
			"author": "陳映真",
			"reference": "〈張大春的轉向論：撒謊的信徒，背離之路〉，《聯合報》，41-42版",
			"year": "1996年6月10日"
		},
		{
			"author": "林瑩秋",
			"reference": "〈張大春為什麼向「李登輝」搖頭？〉，《商業週刊》，54-56頁",
			"year": "1997年6月23日"
		},
		{
			"author": "謝金蓉",
			"reference": "〈張大春：作家本來就是獨裁的！〉，《新新聞週刊》，74-76,79頁",
			"year": "1997年11月30日-12月6日"
		},
		{
			"author": "黃鳳玲",
			"reference": "〈酷夏歷險--看張大春有沒有長獠牙〉，《明道文藝》，137-143頁，270期",
			"year": "1998年9月"
		},
		{
			"author": "王開平報導",
			"reference": "〈重建作家作品現場：張大春/台北〉，《聯合報》，41版",
			"year": "1998年9月21日"
		},
		{
			"author": "顧蕙倩",
			"reference": "〈誰是武林新盟主﹖--聽說書人張大春說「城邦暴力團」〉，《新觀念》，36-37頁，137期",
			"year": "2000年3月"
		},
		{
			"author": "謝淑芬採訪",
			"reference": "〈現代新武俠--張大春文學的再突破〉，《光華》，120-125頁",
			"year": "2000年8月"
		},
		{
			"author": "林燿德",
			"reference": "〈寫作的「指法」與「曲式」-評張大春《沒人寫信給上校》〉，《書評》，16期，3-4頁",
			"year": "1995年6月"
		},
		{
			"author": "詹宏志",
			"reference": "〈幾種語言監獄--讀張大春的小說近作〉，《四喜憂國》，台北：遠流，5-10頁",
			"year": "1988年"
		},
		{
			"author": "魏可風整理",
			"reference": "〈文學外遇：張大春vs.楊照談《撒謊的信徒》〉，《聯合文學》，第十二卷七期，10-18頁",
			"year": "1996年5月"
		}
	];
	$table.bootstrapTable({data: data});
}); 