var $table = $('#table1');
$(function () {
	var data = [
		{
			"author": "大呂、洛城出版社編",
			"reference": "《台灣，在轉捩點上》，台北：大呂、洛城出版社",
			"year": "1986年"
		},
		{
			"author": "王宗法",
			"reference": "〈論八十年代台灣文學的走向〉，《臺灣文藝》，118期",
			"year": "1989年7-8月"
		},
		{
			"author": "王德威",
			"reference": "〈里程碑下的沈思-當代臺灣小說的神話性與歷史感〉《當代台灣文學評論大系：小說批評》，111-131頁，台北：正中書局",
			"year": "1993年"
		},
		{
			"author": "皮述民、金榮華編",
			"reference": "《「中國現代文學與教學國際研討會」論文選集》，國立編譯館，",
			"year": "1997年"
		},
		{
			"author": "江寶釵等編",
			"reference": "《臺灣的文學與環境》，高雄：麗文",
			"year": "1996年"
		},
		{
			"author": "吳錦發",
			"reference": "〈八０年代的台灣文學〉，《臺灣學術研究會誌》，第3期",
			"year": "1988年12月"
		},
		{
			"author": "呂正惠",
			"reference": "〈「政治小說」三論〉，《文星》，第103期",
			"year": "1987年1月"
		},
		{
			"author": "呂正惠",
			"reference": "〈七、八十年代台灣鄉土文學的源流與變遷〉，《四十年來中國文學》，台北：聯合文學出版社",
			"year": "1997年"
		},
		{
			"author": "呂正惠",
			"reference": "〈八０年代臺灣小說的主流〉《世紀末偏航一八○年代臺灣文學論》，台北：時報文化出版，267-292頁",
			"year": "1990年"
		},
		{
			"author": "呂正惠",
			"reference": "〈戰後臺灣社會與臺灣文學〉，《台灣文學中的社會：50年來台灣文學研討會論文集（一）》，93-105頁",
			"year": "1996年"
		},
		{
			"author": "呂正惠",
			"reference": "《戰後臺灣文學經驗》，台北：新地文學出版社",
			"year": "1995年"
		},
		{
			"author": "李瑞騰",
			"reference": "《台灣文學風貌》，台北：三民書局",
			"year": "1990年"
		},
		{
			"author": "李瑞騰",
			"reference": "《臺灣文學風貌》，台北，三民書局",
			"year": "1991年"
		},
		{
			"author": "李歐梵",
			"reference": "〈世界文學的兩個見證--南美和東歐對中國現代文學的啟發〉，《聯合文學》第11期，8-17頁",
			"year": "1985年9月"
		},
		{
			"author": "沈謙",
			"reference": "〈戰後臺灣文壇主流之遞嬗〉《臺灣的文學與環境》，高雄：麗文文化，",
			"year": "1996年"
		},
		{
			"author": "周英雄",
			"reference": "〈八０年代臺灣作家怎麼寫歷史〉《聯合文學》，7卷5期，176-181頁",
			"year": "1991年"
		},
		{
			"author": "周慶華",
			"reference": "〈同情與批判-八０年代小說中的街頭活動〉，《台灣文學中的社會：50年來台灣文學研討會論文集（一）》，台北：文建會",
			"year": "1996年"
		},
		{
			"author": "周慶華",
			"reference": "《台灣文學與「臺灣文學」》，台北：生智",
			"year": "1997年"
		},
		{
			"author": "孟樊",
			"reference": "〈台灣新生代評論家風起雲湧〉，《文訊》，革新第61期",
			"year": "1996年2月"
		},
		{
			"author": "孟樊、林燿德編",
			"reference": "《世紀末偏航--八○年代臺灣文學論》，台北：時報文化出版，",
			"year": "1990年"
		},
		{
			"author": "杭之",
			"reference": "〈八０年代臺灣的思想/文化發展〉，《邁向後美麗島的民間社會》，台北：唐山",
			"year": "1990年"
		},
		{
			"author": "林梵",
			"reference": "〈從迷惘到自主-第一代到第四代的文學過程〉，《台灣文藝》第83期，49-55頁",
			"year": "1983年7月"
		},
		{
			"author": "林亨泰、簡政珍、林燿德",
			"reference": "〈詩人與語言的三角對話〉，《跨不過的歷史》，台北：尚書文化",
			"year": "1990年"
		},
		{
			"author": "林紫慧",
			"reference": "〈八○年代台灣小說的發展-蔡源煌與張大春對談〉，《國文天地》，33-39頁",
			"year": "1988年10月"
		},
		{
			"author": "林燿德",
			"reference": "〈「另類」的領空-序陳裕盛《慾望號捷運》〉，《慾望號捷運》，台北：羚傑",
			"year": "1995年"
		},
		{
			"author": "林燿德",
			"reference": "〈不安海域-八０年代前葉台灣現代詩風潮試論〉，《不安海域》，台北：師大書苑",
			"year": "1988年"
		},
		{
			"author": "林燿德",
			"reference": "〈當代臺灣小說中的上班族/企業文化〉，《台灣文學中的社會：50年來台灣文學研討會論文集（一）》，183-202頁",
			"year": "1996年"
		},
		{
			"author": "封德屏",
			"reference": "《台灣文學中的社會：50年來台灣文學研討會論文集（一）》，台北：文建會",
			"year": "1996年"
		},
		{
			"author": "封德屏",
			"reference": "《台灣文學發展現象：50年來台灣文學研討會論文集（二）》，台北：文建會",
			"year": "1996年"
		},
		{
			"author": "施淑",
			"reference": "〈現代的鄉土-六、七０年代的臺灣文學〉，《兩岸文學論集》，台北：新地",
			"year": "1997年"
		},
		{
			"author": "洪小雯",
			"reference": "〈哈哈鏡下誇大、變形的文學形象-探討八０年代臺灣短篇小說中的魔幻寫實主義〉，《臺灣人文》，創刊號",
			"year": "1997年6月"
		},
		{
			"author": "范雲",
			"reference": "《新生代的自我追尋一臺灣學生運動文獻彙編》，台北：前衛出版，",
			"year": "1993年"
		},
		{
			"author": "唐 狷",
			"reference": "〈「第三世界」究竟是什麼？--第三世界論壇〉，《夏潮》，4卷4期",
			"year": "1978年4月"
		},
		{
			"author": "徐正光、宋文里合編",
			"reference": "《解嚴前後台灣新興社會運動》，台北：巨流",
			"year": "1994年"
		},
		{
			"author": "徐望雲",
			"reference": "〈解嚴，與八０年代後期年輕詩風概觀〉，《文訊》",
			"year": "1996年2月"
		},
		{
			"author": "馬起華",
			"reference": "〈從戒嚴到解嚴〉，《國魂》，499期",
			"year": "1987年6月"
		},
		{
			"author": "張啟疆",
			"reference": "〈當代臺灣小說裏的都市現象〉，《台灣文學中的社會：50年來台灣文學研討會論文集（一）》，205-226頁",
			"year": "1996年"
		},
		{
			"author": "許水綠",
			"reference": "〈臺灣文學界說與方向〉，原載《生根》17期1983年9月25日收入胡民祥編《臺灣文學入門文選》台北：前衛",
			"year": "1995年"
		},
		{
			"author": "許俊雅",
			"reference": "〈戰後台灣小說的階段性變化〉，《台灣文學發展現象：50年來台灣文學研討會論文集（二）》，77-121頁",
			"year": "1996年"
		},
		{
			"author": "郭正亮",
			"reference": "〈新社會宣言〉，《台大自由之愛》，3期",
			"year": "1987年3月"
		},
		{
			"author": "彭小妍",
			"reference": "〈百無禁忌：解嚴後小說面面觀〉，《文訊》，革新第61期",
			"year": "1996年2月"
		},
		{
			"author": "彭瑞金",
			"reference": "《臺灣新文學運動二十年》，台北：春暉，",
			"year": "1997年8月"
		},
		{
			"author": "游喚",
			"reference": "〈八○年代台灣文學論述之變質〉《當代台灣文學評論大系》，台北：時報文化，",
			"year": "1993年"
		},
		{
			"author": "黃凡",
			"reference": "〈評〈嘯阿義，聖阿珠〉〉《海峽小說一九八八》，台北：希代",
			"year": "1988年"
		},
		{
			"author": "黃重添",
			"reference": "《台灣新文學概觀》，台北：稻禾出版社",
			"year": "1992年"
		},
		{
			"author": "楊渡",
			"reference": "《強控制解體：解嚴前後台灣社會的面貌》，台北：遠流",
			"year": "1988年"
		},
		{
			"author": "楊照",
			"reference": "〈從「鄉土寫實」到「超越寫實」-八０年代的台灣小說〉，《臺灣文學發展現象：50年來台灣文學研討會論文集（二）》，137-150頁",
			"year": "1996年"
		},
		{
			"author": "楊照",
			"reference": "《文學、社會與歷史想像-戰後文學史散論》，台北：聯合文學",
			"year": "1995年"
		},
		{
			"author": "楊青矗、向陽",
			"reference": "〈第三世界作家啟示錄〉，《臺灣文藝》，101期",
			"year": "1986年7-8月"
		},
		{
			"author": "楊澤主編",
			"reference": "《從四○年代到九○年代-兩岸三邊華文小說研討會論文集》，台北：時報",
			"year": "1994年11月"
		},
		{
			"author": "楊澤編",
			"reference": "《七○年代理想繼續燃燒》，台北：時報文化",
			"year": "1994年"
		},
		{
			"author": "楊澤編",
			"reference": "《懺情路》，台北：時報文化",
			"year": "1994年"
		},
		{
			"author": "楊熾昌",
			"reference": "《水蔭萍作品集》，台南市立文化中心",
			"year": "1995年"
		},
		{
			"author": "葉石濤",
			"reference": "〈八０年代作家的櫥窗：評「新世代小說大系」〉，《文訊》，革新第7 期（總號46期）",
			"year": "1989年8月"
		},
		{
			"author": "葉石濤",
			"reference": "〈再論台灣小說的提升與淨化〉，《文學界》，第5期",
			"year": "1983年"
		},
		{
			"author": "葉石濤",
			"reference": "《台灣文學史綱》，高雄：文學界雜誌社",
			"year": "1993年"
		},
		{
			"author": "蔡源煌",
			"reference": "〈後設小說的啟示〉，《幼獅文藝》，魏可風〈與「新」對話-小說新人獎十年總回顧〉《聯合文學》 13卷1期",
			"year": "1996年11月"
		},
		{
			"author": "蔡源煌",
			"reference": "《解嚴前後的人文觀察》，台北：遠流",
			"year": "1989年"
		},
		{
			"author": "鄭明娳",
			"reference": "《時代之風--當代文學入門》，台北：幼獅",
			"year": "1991年"
		},
		{
			"author": "鄭明娳",
			"reference": "《當代台灣文學評論大系：小說批評》，台北：正中書局",
			"year": "1993年"
		},
		{
			"author": "鄭炯明編",
			"reference": "《臺灣精神的崛起》，高雄：文學界雜誌",
			"year": "1989年"
		},
		{
			"author": "鄧丕雲",
			"reference": "《八○年代台灣學生運動史》，台北：前衛",
			"year": "1993年"
		}
	];
	$table.bootstrapTable({data: data});
}); 