var $table = $('#table5_2');
$(function () {
	var data = [
		{
			"author": "宋澤萊",
			"reference": "《惡靈》，台北：遠景出版",
			"year": "1978年"
		},
		{
			"author": "宋澤萊",
			"reference": "《紅樓舊事》，台北：聯經，1987年新一版",
			"year": "1979年"
		},
		{
			"author": "宋澤萊",
			"reference": "《禪與文學體驗》，台北：前衛出版",
			"year": "1983年"
		},
		{
			"author": "宋澤萊",
			"reference": "〈文學十日談〉，《臺灣文藝》，革新第十九期，1981年5月後收入《禪與文學體驗》，台北：前衛出版",
			"year": "1983年"
		},
		{
			"author": "宋澤萊",
			"reference": "《誰怕宋澤萊？人權文學論集》，台北：前衛出版",
			"year": "1986年"
		},
		{
			"author": "宋澤萊",
			"reference": "《蓬萊誌異》，台北：前衛出版",
			"year": "1988年"
		},
		{
			"author": "宋澤萊",
			"reference": "《打牛湳村系列》，台北：前衛出版",
			"year": "1988年"
		},
		{
			"author": "宋澤萊",
			"reference": "《弱小民族》，台北：前衛出版",
			"year": "1987年"
		},
		{
			"author": "宋澤萊",
			"reference": "〈抗暴的打貓市〉，《弱小民族》，台北：前衛出版",
			"year": "1987年"
		},
		{
			"author": "宋澤萊",
			"reference": "《廢墟台灣》，台北：草根出版",
			"year": "1985年"
		},
		{
			"author": "宋澤萊",
			"reference": "《宋澤萊集》，台北：前衛",
			"year": "1992年"
		},
		{
			"author": "宋澤萊",
			"reference": "《血色蝙蝠降臨的城市》，台北：草根出版",
			"year": "1996年"
		},
		{
			"author": "宋澤萊",
			"reference": "《熱帶魔界》，台北：草根出版",
			"year": "2001年"
		},
		{
			"author": "宋澤萊",
			"reference": "〈從「打牛湳村」到「蓬萊誌異」--追憶那段美麗、淒清的歲月(1975-1980)〉，《蓬萊誌異》，台北：前衛出版",
			"year": "1988年"
		},
		{
			"author": "宋澤萊",
			"reference": "〈從《福爾摩莎頌歌》到《血色蝙蝠降臨的城市》--追憶那段紅塵吟唱與尋求超越的時光(1980-1996)〉，《血色蝙蝠降臨的城市》，台北：草根出版",
			"year": "1996年"
		},
		{
			"author": "宋澤萊",
			"reference": "〈當前文壇診斷書〉，《臺灣文藝》，新生版13期",
			"year": "1996年2月"
		},
		{
			"author": "宋澤萊",
			"reference": "〈一部臺灣政經、社會的診病大書--試論王定國的《憂國》〉，《臺灣新文學》，5期，235-242頁",
			"year": "1996年8月"
		},
		{
			"author": "宋澤萊",
			"reference": "〈不願再想起佛教〉",
			"year": "1997年5月20日"
		},
		{
			"author": "宋澤萊",
			"reference": "〈重整臺灣文學文化的凹型結構〉，《臺灣新文學》，8期，6-20頁",
			"year": "1997年6月"
		},
		{
			"author": "宋澤萊",
			"reference": "〈正視外省中國殖民文學、文化的變相〉，《臺灣新文學》，6期，6-15 頁",
			"year": "1997年2月"
		},
		{
			"author": "Schues, Catharina G.謝志偉譯",
			"reference": "，〈宋澤萊及其作品〉，《宋澤萊集》，台北：前衛出版社，307-317頁",
			"year": "1992年"
		},
		{
			"author": "石弘毅",
			"reference": "〈從宋澤萊的《打牛湳村系列》看七０年代臺灣農村的變遷〉，《書評》，18期，3-12頁",
			"year": "1995年10月"
		},
		{
			"author": "何欣",
			"reference": "〈宋澤萊論〉，《中外文學》，8:1期，72-96頁",
			"year": "1979年6月"
		},
		{
			"author": "李鴻瓊",
			"reference": "〈創傷、脫離與入世靈恩：宋澤萊的小說《血色蝙蝠降臨的城市》〉，《中外文學》，30卷8期，217-250頁",
			"year": "2002年1月"
		},
		{
			"author": "林端",
			"reference": "〈從宋澤萊的小說談起〉，《文藝月刊》，131-132期，12-22頁",
			"year": "1980年5-6月"
		},
		{
			"author": "施淑",
			"reference": "〈大悲咒〉，《宋澤萊集》，台北：前衛出版社，9-12頁",
			"year": "1992年"
		},
		{
			"author": "洪如玉",
			"reference": "〈《蓬萊誌異》讀後〉，《書評》，25期，13-17頁",
			"year": "1996年12月"
		},
		{
			"author": "高天生",
			"reference": "〈訪宋澤萊談文學創作與作家良心：鷹鸇何事奮雲霄〉，《書評書目》，93期，113-121頁",
			"year": "1981年1月"
		},
		{
			"author": "高天生",
			"reference": "〈新生代的里程碑-論宋澤萊的小說〉，《宋澤萊集》，台北：前衛，289-306頁",
			"year": "1992年"
		},
		{
			"author": "陳文珊",
			"reference": "〈談宋澤萊晚近作品中的神秘經驗〉，《曠野》，4期",
			"year": "1997年"
		},
		{
			"author": "",
			"reference": "〈魔神仔的世界--讀宋澤萊《熱帶魔界》後的隨想〉，四方書評網站",
			"year": "2001年"
		},
		{
			"author": "傅大為",
			"reference": "〈從廢墟世界來的挑戰與鄉愁-談《廢墟台灣》的一種讀法〉，《廢墟臺灣》，5-18頁",
			"year": "1985年"
		},
		{
			"author": "壹闡提",
			"reference": "〈文史一家宋澤萊〉，《書評書目》，83期，35-39頁",
			"year": "1980年3月"
		},
		{
			"author": "廖朝陽",
			"reference": "〈災難與希望：從〈古都〉與《血色蝙蝠降臨的城市》看政治〉，「文化批評論壇第四場」",
			"year": "2001年1月20日"
		},
		{
			"author": "蔡源煌、鍾肇政對談",
			"reference": "〈現實的扭曲-談「打牛湳村」的文體與觀點〉，《臺灣文藝》，58期，115-132頁",
			"year": "1978年3月"
		},
		{
			"author": "龍應台",
			"reference": "〈臺灣的一九八四評「廢墟臺灣」〉，《當代》，1期，148-150頁",
			"year": "1986年5月"
		}
	];
	$table.bootstrapTable({data: data});
}); 