var $table = $('#table4');
$(function () {
	var data = [
		{
			"author": "李建民",
			"reference": "《八０年代臺灣小說中的都市意象》，碩士論文",
			"year": "2000年7月"
		},
		{
			"author": "林慶文《當代臺灣小說的宗教性關懷》",
			"reference": "東海大學中國文學系博士論文",
			"year": "2001年6月"
		},
		{
			"author": "侯作珍",
			"reference": "《從消費社會探討八０年代臺灣小說主題意識的轉變》，文化大學中國文學研究碩士論文",
			"year": "1998年"
		},
		{
			"author": "凌子楚",
			"reference": "《臺灣八０年代社運的政經分析》，臺灣大學三民主義研究所碩士論文",
			"year": "1994年"
		},
		{
			"author": "陳明柔",
			"reference": "《典範的更替／消解與台灣八０年代小說的感覺結構》，東海大學國文研究所博士論文",
			"year": "1999年"
		},
		{
			"author": "陳建忠",
			"reference": "《宋澤萊小說研究》，清華大學中國文學研究所碩士論文",
			"year": "1997年"
		},
		{
			"author": "曾萍萍",
			"reference": "《陳映真小說與後殖民論述》，大學國文研究所碩士論文",
			"year": ""
		},
		{
			"author": "蔡佩熒",
			"reference": "《時代論述的空間線索--以《七○年代》與《狂飆八○》為例》，臺灣大學建築與城鄉研究所碩士論文",
			"year": "2000年"
		},
		{
			"author": "蕭義玲",
			"reference": "《臺灣當代小說的世紀末圖象研究－以解嚴後十年（1987-1997）為觀察對象》，臺灣師範大學國文研究所博士論文",
			"year": "1997年"
		},
		{
			"author": "賴松輝",
			"reference": "《李喬〈寒夜三部曲〉研究》，清華大學中國文學研究所碩士論文",
			"year": "1991年"
		},
		{
			"author": "謝春馨",
			"reference": "《八０年代「臺灣文學」正名論》中央大學中文研究所碩士論文",
			"year": "1995年"
		},
		{
			"author": "鍾怡雯",
			"reference": "《莫言小說：「歷史」的重構》，臺灣師範大學國文研究所碩士論文",
			"year": "1996年"
		},
		{
			"author": "藍博堂",
			"reference": "《臺灣鄉土文學論戰及其餘波(1971-1987)》，臺灣師範大學歷史研究所碩士論文",
			"year": "1992年"
		}
	];
	$table.bootstrapTable({data: data});
}); 