var $table = $('#table2');
$(function () {
	var data = [
		{
			"author": "",
			"reference": "〈後現代文藝狀況〉，《幼獅文藝》",
			"year": "1994年8月"
		},
		{
			"author": "王晴佳",
			"reference": "〈如何看待後現代主義對史學的挑戰？〉，《新史學》，10卷2期",
			"year": "1999年6月"
		},
		{
			"author": "王晶譯",
			"reference": "《後現代性起源》，Perry Anderson著，台北：聯經",
			"year": "1999年"
		},
		{
			"author": "石之瑜",
			"reference": "〈歐美後殖民主義眼中的國際關係與國家認同〉，《歐美學術》，10卷3期",
			"year": "1995年3月"
		},
		{
			"author": "江宜樺",
			"reference": "〈當前臺灣國家認同論述之反省〉，《臺灣社會研究季刊》，29期",
			"year": "1998年3月"
		},
		{
			"author": "宋冬陽",
			"reference": "〈現階段台灣文學本土化的問題〉《台灣文藝》，86期，10-40頁",
			"year": "1984年1月"
		},
		{
			"author": "宋冬陽",
			"reference": "〈傷痕書--致宋澤萊〉《台灣文藝》，99期，15-33頁",
			"year": "1986年3月"
		},
		{
			"author": "林水福發行",
			"reference": "《兩岸後現代文學研討會論文集》，台北：輔仁大學",
			"year": "1998年"
		},
		{
			"author": "林載爵",
			"reference": "〈本土之前的鄉土：談一種思想的可能性的中挫〉「回顧與再思：鄉土文學論戰20年討論會」，台灣社會科學研究會主辦",
			"year": "1997年"
		},
		{
			"author": "林燿德",
			"reference": "〈狐狸的寓言刺蝟學：羅門V.S.後現代〉，《幼獅文藝》",
			"year": "1994年8月"
		},
		{
			"author": "邱彥彬、李翠芬譯",
			"reference": "〈從屬階級能發言嗎？〉，《中外文學》，282期",
			"year": "1995年11月"
		},
		{
			"author": "邱貴芬",
			"reference": "〈「後殖民」的臺灣演繹〉，《文化研究在台灣》，台北：巨流圖書",
			"year": "2000年"
		},
		{
			"author": "邱貴芬",
			"reference": "〈「發現臺灣」：建構臺灣後殖民論述〉，《仲介台灣．女人》，台北：元尊文化",
			"year": "1997年"
		},
		{
			"author": "邱貴芬",
			"reference": "〈是後殖民，不是後現代-再談台灣身份認同政治〉，《中外文學》，21卷2期",
			"year": "1995年"
		},
		{
			"author": "邱貴芬",
			"reference": "〈落後的時間與台灣歷史敘述：試探現代主義時期女作家創作裡另類時間的救贖可能〉，本文宣讀於「現代主義與台灣文學學術研討會」\n（國立政治大學中文系主辦，2001年6月2日~3日）宣讀，修訂槁刊於中興外文系學報",
			"year": ""
		},
		{
			"author": "邱貴芬",
			"reference": "《仲介台灣．女人》，台北：元尊文化",
			"year": "1997年"
		},
		{
			"author": "唐小兵",
			"reference": "〈從革命文體到文體革命〉，《當代》，43期",
			"year": "1989年11月"
		},
		{
			"author": "奚密",
			"reference": "〈後現代的迷障：〈台灣後現代詩的理論與實際〉的反思〉，《當代》，71期",
			"year": "1992年3月"
		},
		{
			"author": "徐賁",
			"reference": "《走向後現代與後殖民》，北京：中國社會科學出版社",
			"year": "1996年"
		},
		{
			"author": "張旭東編",
			"reference": "《晚期資本主義的文化邏輯：詹明信批評理論文選》，香港：牛津大學出版社",
			"year": "1996年"
		},
		{
			"author": "張京媛",
			"reference": "《後殖民理論與文化認同》，台北：麥田",
			"year": "1995年"
		},
		{
			"author": "張國慶",
			"reference": "〈追尋「臺灣意識」的定位：透視〈論臺灣的本土化運動〉之迷思〉《中外文學》，23卷10期，127-133頁",
			"year": "1995年3月"
		},
		{
			"author": "張錦忠譯",
			"reference": "Rubin Suleiman, Susan，〈必也正名乎：文學之「現代對後現代主義」的省思〉，《當代》，43期",
			"year": "1989年11月"
		},
		{
			"author": "陳光中、廖炳惠、鍾明德",
			"reference": "〈從臺灣看後現代主義〉，《中國論壇》，302期；第26卷第2期",
			"year": "1988年4月"
		},
		{
			"author": "陳光興",
			"reference": "〈去殖民的文化研究〉，《台灣社會研究季刊》，第21期，73-139頁",
			"year": "1996年"
		},
		{
			"author": "陳光興",
			"reference": "〈炒作後現代？--評孟樊、羅青、鐘明德的後現代觀〉，《自立早報》",
			"year": "1990年2月23日"
		},
		{
			"author": "陳光興",
			"reference": "〈躲在亮處：爬出後現代理論意識型態的沼澤〉，《中國論壇》，第335期：28卷11期",
			"year": "1989年9月"
		},
		{
			"author": "陳光興主編",
			"reference": "《文化研究在台灣》，台北：巨流圖書",
			"year": "2000年"
		},
		{
			"author": "陳芳明",
			"reference": "〈台灣文學史分期的一個檢討〉，《台灣文學發展現象：50年來台灣文學研討會論文集（二）》，13-34頁，台北：文建會",
			"year": "1996年"
		},
		{
			"author": "陳芳明",
			"reference": "〈殖民歷史與臺灣文學研究-讀陳昭瑛的〈論臺灣本土化運動〉〉《中外文學》，23卷12期，110-119頁",
			"year": "1995年5月"
		},
		{
			"author": "陳芳明",
			"reference": "〈臺灣研究與後殖民史觀〉，《歷史月刊》",
			"year": "1996年10月"
		},
		{
			"author": "陳長房",
			"reference": "〈典範的輪替：從現代到後現代〉，《幼獅文藝》",
			"year": "1994年8月"
		},
		{
			"author": "陳清僑",
			"reference": "〈從「現代」的危機到「另一種」實踐：泛論當前香港的文化政治〉，《當代》，43期",
			"year": "1989年11月"
		},
		{
			"author": "彭瑞金",
			"reference": "〈當前臺灣文學的本土化與多元化-兼論有關臺灣文學的一些異說〉《文學臺灣》，4期，11-36頁",
			"year": "1990年9月"
		},
		{
			"author": "彭瑞金",
			"reference": "〈臺灣文學應以本土化為首要課題〉《文學界》，2期，1-3頁",
			"year": "1982年4月"
		},
		{
			"author": "曾健民",
			"reference": "〈「戰後再殖民論」的顛倒--關於陳芳明的戰後文學史觀的歷史批判〉，《聯合文學》，195期",
			"year": "2001年1月"
		},
		{
			"author": "游勝冠",
			"reference": "《臺灣文學本土論的興起與發展》，台北：前衛",
			"year": "1996年"
		},
		{
			"author": "湯芝萱記錄整理",
			"reference": "〈藝術是時代的代言：楊茂林談後現代繪畫風潮〉，《幼獅文藝》",
			"year": "1994年8月"
		},
		{
			"author": "黃宗慧",
			"reference": "〈雜的痛苦與/或雜的希望-從巴巴的揉雜理論談起〉，《英美文學評論2》，87-100頁",
			"year": "1995年"
		},
		{
			"author": "楊明蒼",
			"reference": "〈詹明信的後現代理論與台灣〉，《中外文學》，第22卷3期",
			"year": "1995年12月"
		},
		{
			"author": "葉維廉",
			"reference": "〈現代到後現代：傳釋的架構〉，《當代》，43期",
			"year": "1989年11月"
		},
		{
			"author": "葉維廉",
			"reference": "《解讀現代‧後現代》，台北：東大",
			"year": "1992年"
		},
		{
			"author": "詹明信，唐小兵譯",
			"reference": "〈處於跨國資本主義時代中的第三世界文學〉《馬克思主義：後冷戰時代的思索》，87-112頁，香港：牛津大學",
			"year": "1994年"
		},
		{
			"author": "詹明信，唐小兵譯",
			"reference": "《後現代主義與文化理論》，台北：合志",
			"year": "1989年"
		},
		{
			"author": "廖咸浩",
			"reference": "〈那麼請愛你的敵人：與廖朝陽談『情』說『愛』〉，《中外文學》24卷7期",
			"year": "1995年"
		},
		{
			"author": "廖咸浩",
			"reference": "〈超越國族：為什麼要談認同？〉，《中外文學》，24卷4期",
			"year": "1995年"
		},
		{
			"author": "廖咸浩",
			"reference": "〈複眼觀花、複音合唱：八十四年短篇小說的後現代風貌〉《八十四年短篇小說選》，台北：爾雅",
			"year": "1996年"
		},
		{
			"author": "廖炳惠",
			"reference": "〈比較文學與現代詩篇：試論台灣的「後現代詩」〉，《中外文學》，第24卷2期",
			"year": "1995年7月"
		},
		{
			"author": "廖炳惠",
			"reference": "〈在台灣談後現代與後殖民論述〉，《後殖民理論與文化認同》，台北：麥田",
			"year": "1995年"
		},
		{
			"author": "廖炳惠",
			"reference": "〈後現代文化與藝術總論〉，《幼獅文藝》",
			"year": "1994年8月"
		},
		{
			"author": "廖炳惠",
			"reference": "〈後殖民研究的問題及前景（上）（下）〉，《當代》，第121、122期",
			"year": "1997年9、10月"
		},
		{
			"author": "廖炳惠",
			"reference": "〈後殖民與後現代：Homi K. Bhabha的訪談〉，《當代》，71期",
			"year": "1992年3月"
		},
		{
			"author": "廖炳惠",
			"reference": "〈臺灣：後現代或後殖民？〉，《兩岸後現代文學研討會論文集》，台北：輔仁大學",
			"year": "1998年"
		},
		{
			"author": "趙剛",
			"reference": "〈論現階段無住屋運動的理論與實踐〉，《當代》，53期",
			"year": "1990年9月"
		},
		{
			"author": "劉紀雯",
			"reference": "〈導讀〉，《後現代文化導論》，1-11頁",
			"year": "1999年"
		},
		{
			"author": "劉紀蕙",
			"reference": "〈臺灣文化場域內「中國符號」與「臺灣圖像」的展演與變異〉，《孤兒、女神、負面書寫》，台北：立緒出版社",
			"year": "2000年"
		},
		{
			"author": "劉紀蕙",
			"reference": "《孤兒、女神、負面書寫》，台北：立緒出版社",
			"year": "2000年"
		},
		{
			"author": "劉紀蕙、周英雄編",
			"reference": "《書寫台灣-文學史、後殖民與後現代》，台北：麥田",
			"year": "1990年"
		},
		{
			"author": "樂黛云",
			"reference": "〈第三世界文化的提出及其前景〉，《電影藝術》，30-32頁",
			"year": "1996年"
		},
		{
			"author": "蔡淑惠譯",
			"reference": "〈超越後殖民論述的思維：訪問伊匹發尼歐‧桑恩璜(Epifanio San Juan)〉，《當代》，第148期",
			"year": "1999年12月"
		},
		{
			"author": "蔡源煌",
			"reference": "〈後現代的文化問題：訪詹明信教授〉，《文星》，71期",
			"year": "1992年3月"
		},
		{
			"author": "蔡源煌",
			"reference": "《從浪漫主義到後現代主義》，台北：雅典出版社",
			"year": "1988年"
		},
		{
			"author": "蕭新煌",
			"reference": "〈臺灣社會的發展經驗：從殖民主義到資本主義〉，《華人地區發展經驗與中國前途》，台北：政大國關中心",
			"year": "1988年"
		},
		{
			"author": "鍾明德",
			"reference": "〈關於臺灣後現代劇場〉，《幼獅文藝》",
			"year": "1994年8月"
		},
		{
			"author": "鍾明德",
			"reference": "《在後現代主義的雜音中》，台北：書林",
			"year": "1989年"
		},
		{
			"author": "簡政珍",
			"reference": "〈後現代的反思：藝術作品的身姿-評葉維廉的《解讀現代‧後現代》〉，《中外文學》，第24卷7期",
			"year": "1995年12月"
		},
		{
			"author": "羅青",
			"reference": "《什麼是後現代主義？》，台北：五四",
			"year": "1989年"
		}
	];
	$table.bootstrapTable({data: data});
}); 