var $table = $('#table5_3');
$(function () {
	var data = [
		{
			"author": "林燿德",
			"reference": "《惡地形》，台北：希代",
			"year": "1988年"
		},
		{
			"author": "宋澤萊",
			"reference": "《一九四七高砂百合》，台北：聯合文學",
			"year": "1990年"
		},
		{
			"author": "宋澤萊",
			"reference": "《大日如來》，台北：希代",
			"year": "1991年"
		},
		{
			"author": "宋澤萊",
			"reference": "《時間龍》，台北：時報",
			"year": "1994年"
		},
		{
			"author": "宋澤萊",
			"reference": "《鋼鐵蝴蝶》，台北：聯合文學",
			"year": "1997年"
		},
		{
			"author": "宋澤萊",
			"reference": "〈城市‧迷宮‧沈默〉，《鋼鐵蝴蝶》，台北：聯合文學，290-295頁",
			"year": "1997年"
		},
		{
			"author": "宋澤萊",
			"reference": "〈臺灣當代科幻文學〉，《幼獅文藝》，44-47頁、42-48頁",
			"year": "1993年7-8月"
		},
		{
			"author": "宋澤萊",
			"reference": "〈淚的寫實與血的浪漫《呂赫若小說》〉，《聯合報》，42版",
			"year": "1995年9月21日"
		},
		{
			"author": "宋澤萊",
			"reference": "〈從異鄉客到世界人〉，《中縣文藝》，5期，25-28頁",
			"year": "1991年10月"
		},
		{
			"author": "宋澤萊",
			"reference": "〈省籍作家的臍帶情結--鄉土經驗與原鄉幻像〉，《聯合報》，42版",
			"year": "1994年10月20日"
		},
		{
			"author": "宋澤萊",
			"reference": "〈傳統之軸與前衛之輪-半世紀的臺灣散文面目〉，《聯合文學》，11卷12期",
			"year": "1996年3月"
		},
		{
			"author": "王浩威",
			"reference": "〈偉大的獸-林燿德文學理論的建構〉，《聯合文學》，12卷5期",
			"year": "1996年3月"
		},
		{
			"author": "古遠清",
			"reference": "〈在現實與夢幻之間-評林燿德短篇小說集「惡地形」〉，《書評》，23-26頁",
			"year": "1995年2月"
		},
		{
			"author": "朱雙一",
			"reference": "〈資訊文明的審視焦點和深度觀照-林燿德小說論〉，《聯合文學》，12卷5期",
			"year": "1996年3月"
		},
		{
			"author": "朱雙一",
			"reference": "〈邁向壯闊的史詩-評林燿德的《高砂百合》〉，《聯合文學》，7卷5期",
			"year": "1991年3月"
		},
		{
			"author": "吳潛誠",
			"reference": "〈遊走在後現代城市的想像迷宮-重讀林燿德的散文創作〉，《聯合文學》，12卷5期",
			"year": "1996年3月"
		},
		{
			"author": "林水福",
			"reference": "〈試論《一九四七高砂百合》〉，《林燿德與新世代作家文學論》，353-369頁，台北：行政院文化建設委員會",
			"year": "1997年"
		},
		{
			"author": "陳淑卿",
			"reference": "〈書寫原住民歷史災難：《倒風內海》的空間歷史與《一九四七高砂百合》的歷史空間〉，《中外文學》，309期，55-85頁",
			"year": "2002年2月"
		},
		{
			"author": "陳裕盛",
			"reference": "〈一部化繁為簡的世界史縮影-林燿德的科幻小說《時間龍》〉，《文訊雜誌》，10-13頁",
			"year": "1997年3月"
		},
		{
			"author": "彭小妍",
			"reference": "〈歷史、寫實、寓言：解嚴後的歷史寓言小說〉，《歷史很多漏洞：從張我軍到李昂》，115-135頁，台北：中研院文哲所籌備處",
			"year": "2000年"
		},
		{
			"author": "曾麗玲",
			"reference": "〈《1947高砂百合》與《尤利西斯》的歷史想像與書寫〉，《中外文學》，26卷8期，156-183頁",
			"year": "1998年"
		},
		{
			"author": "馮青",
			"reference": "〈帶著光速飛竄的神童--一個解碼者/革命之子/林燿德〉，《自由青年》，64-72頁",
			"year": "1987年9月"
		},
		{
			"author": "楊仔",
			"reference": "〈末世紀文明之上的天空之城-評林燿德的小說集《大東區》〉，《書評》，22期，22-24頁",
			"year": ""
		},
		{
			"author": "楊宗翰",
			"reference": "〈「現代派」的隔代會遇--施蟄存與林燿德〉，《幼獅文藝》，40-41頁",
			"year": "1997年"
		},
		{
			"author": "楊麗玲",
			"reference": "〈文學惡地形上的戰將：林燿德〉，《自由青年》",
			"year": "1990年2月"
		},
		{
			"author": "齊隆壬",
			"reference": "〈臺灣版圖的四重奏與原住民神話的終結：評林燿德小說《一九四七--高砂百合》〉，《當代》，136-145頁，57期",
			"year": "1991年1月"
		},
		{
			"author": "劉紀蕙",
			"reference": "〈林燿德與臺灣文學的後現代轉向〉，《孤兒‧女神‧負面書寫》，368-395頁，台北：立緒",
			"year": "2000年"
		},
		{
			"author": "劉紀蕙",
			"reference": "〈時間龍與後現代暴力書寫的問題〉，《孤兒‧女神‧負面書寫》，396-422頁，台北：立緒",
			"year": "2000年"
		},
		{
			"author": "劉登翰、朱立立",
			"reference": "〈《高砂百合》的神話建構與解構〉，《明道文藝》，302期，162-168頁",
			"year": "2001年5月"
		},
		{
			"author": "潘亞敦",
			"reference": "〈曄曄的青春氣息-評林燿德《惡地形》〉，《聯合文學》，5卷4期，",
			"year": "193-195頁"
		},
		{
			"author": "鄭恆雄",
			"reference": "〈林燿德《1947高砂百合》的歷史神話符號系統〉，《中外文其它小說家作品及評論》",
			"year": ""
		},
		{
			"author": "王德威",
			"reference": "〈鄉土小說的夢魘【呂則之著《荒地》】〉，《聯合文學》，204-205頁",
			"year": "1985年2月"
		},
		{
			"author": "平路",
			"reference": "《五印封緘》，台北︰圓神",
			"year": "1988年"
		},
		{
			"author": "吳錦發",
			"reference": "《吳錦發集》，台北：前衛",
			"year": "1992年"
		},
		{
			"author": "呂則之",
			"reference": "《荒地》，台北：草根，原作1984出版",
			"year": "1997年"
		},
		{
			"author": "宋澤萊",
			"reference": "〈從經濟壓迫到族群壓迫到國族壓迫-試介吳錦發高超的寫實文學〉《台灣新文藝》，14期，116-153頁",
			"year": "2000月3月"
		},
		{
			"author": "宋澤萊",
			"reference": "《行道天涯》，台北︰聯合文學",
			"year": "1995年"
		},
		{
			"author": "李喬",
			"reference": "〈泰姆山記〉，《告密者》，台北：自立晚報",
			"year": "1986年"
		},
		{
			"author": "李喬",
			"reference": "《告密者》，台北：自立晚報",
			"year": "1986年"
		},
		{
			"author": "周英雄",
			"reference": "〈從兩個碑石看兩個社會：〈將軍碑〉與〈小鮑莊〉的現代意義〉，當代，37期",
			"year": "1989年5月"
		},
		{
			"author": "林素芬",
			"reference": "〈打造內在異質空間的英雄-作家楊照專訪〉，《幼獅文藝》，18-24頁",
			"year": "1997年9月"
		},
		{
			"author": "林盛彬",
			"reference": "〈《玉米人》的圖騰與象徵〉，《玉米人》，台北：桂冠，ix-xx頁",
			"year": "1994年"
		},
		{
			"author": "南方朔",
			"reference": "〈重塑革命者的血肉和心情--看馬奎茲(Garbriel Garcia Marquez)「迷宮中的將軍」到平路的「行道天涯」〉，《聯合文學》，154-157頁",
			"year": "1995年4月"
		},
		{
			"author": "施淑",
			"reference": "〈現代啟示錄-王幼華集序〉，《王幼華集》，台北：前衛，9-11頁",
			"year": "1992年"
		},
		{
			"author": "施淑〈現代啟示錄-王幼華集序〉",
			"reference": "《王幼華集》，9-11頁，台北：前衛",
			"year": "1992年"
		},
		{
			"author": "馬森",
			"reference": "《孤寂》，台北：聯經，1985年再版",
			"year": "1979年"
		},
		{
			"author": "高天生",
			"reference": "〈詛咒與夢魘--台灣小說中的告密者〉，自立晚報",
			"year": "1987年9月1日"
		},
		{
			"author": "高天生",
			"reference": "〈臺灣作家的新指標-吳錦發集序〉，《吳錦發集》，台北：前衛，9-12頁",
			"year": "1992年"
		},
		{
			"author": "張大春〈丟帽子砸招牌--言論箝制時局的意識型態論爭〉",
			"reference": "《中國時報》",
			"year": "1991年1月7日"
		},
		{
			"author": "張系國",
			"reference": "〈銅像城〉，《星雲組曲》，台北：洪範，1985年再版",
			"year": "1980年"
		},
		{
			"author": "張惠娟",
			"reference": "〈臺灣後設小說試論〉，《世紀末偏航》，台北：時報文化，299-322頁",
			"year": "1990年"
		},
		{
			"author": "張惠菁",
			"reference": "《末日早晨》，台北：大田",
			"year": "2000年"
		},
		{
			"author": "張錦忠",
			"reference": "〈黃凡與未來：兼注台灣科幻小說〉，《中外文學》，205-217頁",
			"year": "1994年5月"
		},
		{
			"author": "許秀霞",
			"reference": "〈在歷史幽暗的角落-試論楊照「黯魂」〉，《台灣文藝（新生版）》，165期，132-140頁",
			"year": "1998年10月"
		},
		{
			"author": "陳芳明",
			"reference": "《探索台灣史觀》，台北：自立晚報",
			"year": "19992年"
		},
		{
			"author": "彭瑞金〈探索的、反叛的漂泊者〉",
			"reference": "《王幼華集》，163-275頁，台北：前衛",
			"year": "1992年"
		},
		{
			"author": "黃凡",
			"reference": "《黃凡集》，台北：前衛",
			"year": "1992年"
		},
		{
			"author": "黃克全",
			"reference": "〈具體而為的大家風範：蔡秀女「乾燥的七月」〉，《文訊》，39期，96-99頁",
			"year": "1988年12月"
		},
		{
			"author": "楊照",
			"reference": "《黯魂》，台北：皇冠",
			"year": "1993年"
		},
		{
			"author": "葉姿麟",
			"reference": "《都市的雲》，台北：時報",
			"year": "1986年"
		},
		{
			"author": "廖咸浩",
			"reference": "《愛與解構：當代台灣文學評論與文化觀察》，台北：聯合文學",
			"year": "1995年"
		},
		{
			"author": "劉習良",
			"reference": "〈魔幻和現實的融合〉，《玉米人》，台北：桂冠，xxi-xxxi頁",
			"year": "1994年"
		},
		{
			"author": "蔡秀女",
			"reference": "《乾燥的七月》，台北：時報",
			"year": "1987年"
		}
	];
	$table.bootstrapTable({data: data});
}); 