var $table = $('#table');
$(function () {
	var data = [
		{
			"name": "三六九小報",
			"start": "昭和5年9月9日(西元1930年)",
			"end": "昭和10年9月6日(西元1935年)",
			"number": "第1～479號",
			"period": "每月刊行9次，共479期、483冊",
			"place": "臺南市白金町三丁目九六番地",
			"agency": "三六九小報社"
		},
		{
			"name": "曉鐘",
			"start": "昭和6年12月18日(西元1931年)",
			"end": "昭和7年?月?日(西元1932年)",
			"number": "創刊號～3號，共3冊",
			"period": "月刊",
			"place": "虎尾郡土庫庄埔姜崙二七七番地",
			"agency": "曉鐘社"
		},
		{
			"name": "南音",
			"start": "昭和7年1月1日(西元1932年)",
			"end": "昭和7年10月?日(西元1932年)",
			"number": "第1號～第1卷第12號",
			"period": "半月刊，共12期、12冊",
			"place": "臺北市永樂町二丁目八十八番地",
			"agency": "文藝雜誌南音社"
		},
		{
			"name": "フォルモサ(福爾摩沙)",
			"start": "昭和8年7月15日(西元1933年)",
			"end": "昭和9年6月15日(西元1934年)",
			"number": "第1～3號",
			"period": "不定期，共3期、3冊",
			"place": "日本東京市本鄉四丁目十七番地",
			"agency": "臺灣藝術研究會"
		},
		{
			"name": "南雅",
			"start": "昭和8年8月5日(西元1933年)",
			"end": "昭和9年3月15日(西元1934年)",
			"number": "創刊號～16號，共16期",
			"period": "旬刊",
			"place": "基隆市高砂町二丁目五六",
			"agency": "文藝雜誌南雅社"
		},
		{
			"name": "先發部隊",
			"start": "昭和9年7月15日(西元1934年)",
			"end": "昭和9年7月15日(西元1934年)",
			"number": "第1號",
			"period": "1期、1冊",
			"place": "臺北市新起町三ノ二六",
			"agency": "臺灣文藝協會出版部"
		},
		{
			"name": "媽祖",
			"start": "昭和9年10月10日(西元1934年)",
			"end": "昭和13年3月3日(西元1938年)",
			"number": "第1～16期，共16冊",
			"period": "雙月刊",
			"place": "臺北市大正町一ノ一四",
			"agency": "媽祖書房"
		},
		{
			"name": "《臺灣文藝》(台灣文藝聯盟)",
			"start": "昭和9年11月5日(西元1934年)",
			"end": "昭和11年8月28日(西元1936年)",
			"number": "第1卷第1號～第3卷第8號",
			"period": "月刊，共19期、16冊",
			"place": "臺北市初音町二丁目十三番地",
			"agency": "臺灣文藝聯盟"
		},
		{
			"name": "第一線",
			"start": "昭和10年1月6日(西元1935年)",
			"end": "昭和10年1月6日(西元1935年)",
			"number": "第2號，共1冊",
			"period": "僅1期",
			"place": "臺北市新起町三ノ六七",
			"agency": "臺灣文藝協會出版部"
		},
		{
			"name": "風月",
			"start": "昭和10年5月9日(西元1935年)",
			"end": "昭和11年2月8日(西元1936年)",
			"number": "第1～44號，共44期",
			"period": "每月刊行9次",
			"place": "臺北市蓬萊町二二一番地",
			"agency": "風月俱樂部"
		},
		{
			"name": "台灣新文學",
			"start": "昭和10年12月28日(西元1935年)",
			"end": "昭和12年6月15日(西元1937年)",
			"number": "第1卷第1號～第2卷第5號",
			"period": "月刊，共15期、15冊",
			"place": "台中州大屯郡霧峯庄吳厝九七",
			"agency": "臺灣新文學社"
		},
		{
			"name": "新文學月報",
			"start": "昭和11年2月6日(西元1936年)",
			"end": "昭和11年3月2日(西元1936年)",
			"number": "第1～2號，共2冊",
			"period": "月刊",
			"place": "臺中州大屯郡霧峰吳厝九七",
			"agency": "臺灣新文學社"
		},
		{
			"name": "華麗島",
			"start": "昭和14年12月1日(西元1939年)",
			"end": "昭和14年12月1日(西元1939年)",
			"number": "第1號，共1冊",
			"period": "僅1期",
			"place": "臺北市大正町一ノ二",
			"agency": "臺灣詩人協會"
		},
		{
			"name": "文藝臺灣",
			"start": "昭和15年1月1日(西元1940年)",
			"end": "昭和19年1月1日(西元1944年)",
			"number": "第1卷第1號～第7卷2號",
			"period": "雙月刊，共38期、38冊",
			"place": "臺北市大正町一ノ一四",
			"agency": "臺灣文藝家協會"
		}
	];
	$table.bootstrapTable({data: data});
}); 